//（在项目跟进中学习、不要把精力花在学习基础上，要学会解决）
//（python元组、数组、字典学完）
//（学Linux）
//（建在线表格+每周记录学习跟进进度）
//（自己构思项目）
//
//显示屏 +编号          记录为 excel表格  
//
//nano最后插电源、如果要拔卡一定得拔电源
//nano引脚分布图（查）可外接设备
//供电一定要用黄色头
//按天线需要芯片、插入板中  
//
//李亚鹏、毕设、付 （山下3台）    山上五台     nano尽可能人手一台  （七台（两台损坏）+还需十一台）
//
//三台显示（尽量要）+硬盘   
//
//nano中（密码12345）
//
//ctrl+alt +t 等于 cmd运行窗口
//第二个即相当于代码编译器
//cd 
//
//src 功能包 编译不通过版本不兼容
//
//yolo命令行需要改tiny和name
//
//tiny——权重文件
//coco.name——检索
//.cfg
//
//ros和yolo环境不兼容、环境要配
//看老头视频
//——————————————————————————————————————————————
//ros版本一定需要用melodic（ubuntu 18.04）
//等有成果再弄到nano上，先在linux中用18.04学习
//
//
//-p 新建文件包   编译成exe  
//第三个是建工作站 编译中不可能有红
//一个一个source（注册）
//现有的nano系统是换源过后的，一般比较慢
//
//git clone **********（网址）建议在windows上下好再拷到nano上
//仿真参数（改） ros把电机舵机完成控制
//工作站 rviz中可以完成仿真小车的跑动
//摄像头+激光雷达

